
# coding: utf-8

'''
[ソースコード引用元]

日本語文字列操作　ひらがな判定など Remrinのpython攻略日記
http://python-remrin.hatenadiary.jp/entry/2017/04/26/123458
'''

#--------------------------------------------------
# ひらがな・カタカナの変換や判定を行う
#--------------------------------------------------
hiragana      = "あいうえおかきくけこさしすせそたちつてとなにぬねのはひふへほまみむめもやゆよらりるれろわをんがぎぐげござじずぜぞだぢづでどばびぶべぼぱぴぷぺぽぁぃぅぇぉっゃゅょゎゐゑーぶ"
katakana      = "アイウエオカキクケコサシスセソタチツテトナニヌネノハヒフヘホマミムメモヤユヨラリルレロワヲンガギグゲゴザジズゼゾダヂヅデドバビブベボパピプペポァィゥェォッャュョヮヰヱーヴ"
komoji_oomoji = {'ぁ':'あ', 'ぃ':'い', 'ぅ':'う', 'ぇ':'え', 'ぉ':'お', 'ゃ':'や', 'ゅ':'ゆ', 'ょ':'よ', 'ゎ':'わ', 'っ':'つ', 
                 'ァ':'ア', 'ィ':'イ', 'ゥ':'ウ', 'ェ':'エ', 'ォ':'オ', 'ャ':'ヤ', 'ュ':'ユ', 'ョ':'ヨ', 'ヮ':'ワ', 'ッ':'つ'}

#--------------------------------------------------
# ひらがなだけの文字列ならTrue
#--------------------------------------------------
def is_hira(word):
    return all([ch in hiragana for ch in word])

#--------------------------------------------------
# カタカナだけの文字列ならTrue
#--------------------------------------------------
def is_kata(word):
    return all([ch in katakana for ch in word])

#--------------------------------------------------
# 小文字ならTrue
#--------------------------------------------------
def is_komoji(word):
    return word in komoji_oomoji.keys()

#--------------------------------------------------
# 大文字ならTrue
#--------------------------------------------------
def is_oomoji(word):
    return word not in komoji_oomoji.keys()

#--------------------------------------------------
# ひらがなに直す
#--------------------------------------------------
def to_hira(word):
    if is_hira(word) == True:
        return word
    else:
     return "".join([chr(ord(ch) - 96) if ("ァ" <= ch <= "ン") else ch for ch in word])
    
#--------------------------------------------------
# カタカナに直す        
#--------------------------------------------------
def to_kata(word):
    if is_kata(word) == True:
        return word
    else:
        return "".join([chr(ord(ch) + 96) if ("ぁ" <= ch <= "ん") else ch for ch in word])

#--------------------------------------------------
# 小文字を大文字に直す
#--------------------------------------------------
def to_oomoji(word):
    if is_oomoji(word) == True:
        return word
    else:
        return komoji_oomoji[word]